## Unveiling the Stars: An Exploratory Study on NASA Astronauts

We are tasked with exploring the dataset about the  demographics, careers, and accomplishments of NASA astronauts.

Using the latest tools and techniques in data analysis, you dissect the dataset, analysing astronauts' backgrounds, experiences, and missions. We will uncover patterns and trends that reveal the diverse tapestry ofabout NASA's astronaut corps, from their educational journeys to their military service and their remarkable achievements in space.

## Module 1
### Task 1: Exploring NASA's Data Universe.
Our analysis of NASA's dataset is a mission to unveil profound insights within the realm of space exploration. Beyond mere data analysis, it's a journey to harness the knowledge hidden in the stars. Through this exploration, we aim to uncover patterns that will guide future missions, enhancing NASA's cosmic endeavors. Every data point is a piece of the cosmic puzzle, fueling innovation and inspiring generations to reach for the stars. In these numbers and statistics, we find the roadmap to the next frontier of human exploration.

In [4]:
#--- Import Pandas ---
import pandas as pd
# remove any future warning 
import warnings
warnings.filterwarnings("ignore")
#--- Read in dataset ----
df = pd.read_csv("nasa.csv")

#--- Inspect data ---
df.head()

,Name,Year,GroupNum,Status,Birth_Date,Birth_Place,Gender,Alma_Mater,Undergraduate_Major,Graduate_Major,Military_Rank,Military_Branch,Space_Flights,Space_Flight_hr,Space_Walks,Space_Walks_hr,Missions,Death_Date,Death_Mission
0,Alan B. Shepard Jr.,1959,1,Deceased,18-11-1923,"East Derry, NH",Male,US Naval Academy,Naval Sciences,Naval Science,Rear Admiral,US Navy (Retired),2,216,2,9.0,"Mercury 3, Apollo 14",21-07-1998,Natural causes
1,Alan G. Poindexter,1998,17,Deceased,05-11-1961,"Pasadena, CA",Male,Georgia Institute of Technology; US Naval Post...,Aerospace Engineering,Aeronautical Engineering,Captain,US Navy,2,669,0,0.0,"STS-122 (Atlantis), STS-131 (Discovery)",01-07-2012,Personal watercraft accident
2,Alan L. Bean,1963,3,Deceased,15-03-1932,"Wheeler, TX",Male,University of Texas,Aeronautical Engineering,Aeronautical Engineering,Captain,US Navy (Retired),2,1671,3,10.0,"Apollo 12, Skylab 3",26-05-2018,Natural causes
3,Albert Sacco Jr.,1963,3,Retired,03-05-1949,"Boston, MA",Male,Northeastern University; MIT,Chemical Engineering,Chemical Engineering,Captain,US Navy (Retired),1,381,0,0.0,STS-73 (Columbia),NaN,NaN
4,Alfred M. Worden,1966,5,Retired,07-02-1932,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaN,NaN

### Task 2: Exploring Data Completeness.

In this step our task is to count all null values to know the extent of our data completeness

In [5]:
null_values = df.isnull().sum()

#--- Inspect data ---
print(df.shape)
null_values

(357, 19)

Name                     0
Year                     0
GroupNum                 0
Status                   0
Birth_Date               0
Birth_Place              0
Gender                   0
Alma_Mater               1
Undergraduate_Major      0
Graduate_Major           0
Military_Rank            0
Military_Branch          0
Space_Flights            0
Space_Flight_hr          0
Space_Walks              0
Space_Walks_hr           0
Missions                 0
Death_Date             303
Death_Mission          309
dtype: int64

### Task 3: Data Refinement for NASA Astronaut Data.
In our ongoing journey through the NASA astronaut dataset, we'll begin our data cleaning process by removing missing values in the Alma_Mater column. In addition, we filter rows where Death_Mission is null and 'Death_Date' not null inorder to idenitfy astronaunts that are deceased but death date are not mentioned.Converting the Birth_Date and the Death_date to datetime inorder to make our analysis later easier.

In [6]:
# dropping null values in alma_mater
df["Alma_Mater"].dropna(inplace=True)

# filtering values where death_mission is null and death_date is not null
incorrect_df = df[(df["Death_Mission"].isnull()) & (df["Death_Date"].notna()) ].index
df.drop(incorrect_df,inplace=True)

# converting birth date and death date to datetime
dates_to_change = ["Birth_Date","Death_Date"]
df[dates_to_change] = df[dates_to_change].apply(pd.to_datetime)
#--- Inspect data ---
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 0 to 356
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 351 non-null    object
 1   Year                 351 non-null    int64
 2   GroupNum             351 non-null    int64
 3   Status               351 non-null    object
 4   Birth_Date           351 non-null    datetime64[ns]
 5   Birth_Place          351 non-null    object
 6   Gender               351 non-null    object
 7   Alma_Mater           350 non-null    object
 8   Undergraduate_Major  351 non-null    object
 9   Graduate_Major       351 non-null    object
 10  Military_Rank        351 non-null    object
 11  Military_Branch      351 non-null    object
 12  Space_Flights        351 non-null    int64
 13  Space_Flight_hr      351 non-null    int64
 14  Space_Walks          351 non-null    int64
 15  Space_Walks_hr       351 non-null    float64
 16  Missions             351 non-null    object
 17  Death_Date           48 non-null     datetime64[ns]
 18  Death_Mission        48 non-null     object
dtypes: datetime64[ns](2), float64(1), int64(5), object(11)
memory usage: 54.8+ KB

### Task 4: Preparing Data for SQL Analysis.
In the midst of our data journey through the NASA astronaut dataset, we've arrived at a point where our focus shifts to data export and preparation for a new phase in your analysis.

The destination is  a CSV file named 'astronauts.csv' that will serve as the foundation for your SQL exploration. This export step ensures that the data we've curated and cleaned is ready to be loaded into a relational database, where we can gain deeper insights.

In [7]:
#export the cleaned data
df.to_csv("cleaned_nasa.csv",index=False)


### Task 5: Data Download, Import, and Database Connection.

In [8]:
# -- Load the sql extention ----
%load_ext sql

# --- Load your mysql db using credentials from the "DB" area ---
%sql mysql+pymysql://root:password@localhost/nasa_data

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'mysql+pymysql://root:***@localhost/nasa_data'

## Module 2
### Task 1: Journeying Through Astronaut Profiles.
We embark on an interstellar adventure, peering into the captivating lives of NASA's space explorers. Each line of code unveils tales of cosmic bravery, where data becomes the canvas for astronauts' remarkable journeys.

As we execute this query, we're driven by the desire to inspire, inform, and honor their journeys. Each row of data represents a chapter in the grand story of space exploration, and by querying it, we're paying homage to their remarkable endeavors. We're doing this query to shed light on the heroes of the cosmic frontier and to share their awe-inspiring narratives with the world.

In [9]:
%%sql
select * from cleaned_nasa limit 5

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

5 rows affected.

+-----------------+---------------------+------+----------+----------+------------+----------------+--------+---------------------------------------------------------------+--------------------------+------------------------------------------+---------------+------------------------+---------------+-----------------+-------------+----------------+-----------------------------------------+------------+------------------------------+
| MyUnknownColumn |         Name        | Year | GroupNum |  Status  | Birth_Date |  Birth_Place   | Gender |                           Alma_Mater                          |   Undergraduate_Major    |              Graduate_Major              | Military_Rank |    Military_Branch     | Space_Flights | Space_Flight_hr | Space_Walks | Space_Walks_hr |                 Missions                | Death_Date |        Death_Mission         |
+-----------------+---------------------+------+----------+----------+------------+----------------+--------+---------------------------------------------------------------+--------------------------+------------------------------------------+---------------+------------------------+---------------+-----------------+-------------+----------------+-----------------------------------------+------------+------------------------------+
|        0        | Alan B. Shepard Jr. | 1959 |    1     | Deceased | 1923-11-18 | East Derry, NH |  Male  |                        US Naval Academy                       |      Naval Sciences      |              Naval Science               |  Rear Admiral |   US Navy (Retired)    |       2       |       216       |      2      |      9.0       |           Mercury 3, Apollo 14          | 1998-07-21 |        Natural causes        |
|        1        |  Alan G. Poindexter | 1998 |    17    | Deceased | 1961-11-05 |  Pasadena, CA  |  Male  | Georgia Institute of Technology; US Naval Postgraduate School |  Aerospace Engineering   |         Aeronautical Engineering         |    Captain    |        US Navy         |       2       |       669       |      0      |      0.0       | STS-122 (Atlantis), STS-131 (Discovery) | 2012-07-01 | Personal watercraft accident |
|        2        |     Alan L. Bean    | 1963 |    3     | Deceased | 1932-03-15 |  Wheeler, TX   |  Male  |                      University of Texas                      | Aeronautical Engineering |         Aeronautical Engineering         |    Captain    |   US Navy (Retired)    |       2       |       1671      |      3      |      10.0      |           Apollo 12, Skylab 3           | 2018-05-26 |        Natural causes        |
|        3        |   Albert Sacco Jr.  | 1963 |    3     | Retired  | 1949-05-03 |   Boston, MA   |  Male  |                  Northeastern University; MIT                 |   Chemical Engineering   |           Chemical Engineering           |    Captain    |   US Navy (Retired)    |       1       |       381       |      0      |      0.0       |            STS-73 (Columbia)            |            |                              |
|        4        |   Alfred M. Worden  | 1966 |    5     | Retired  | 1932-02-07 |  Jackson, MI   |  Male  |          US Military Academy; University of Michigan          |     Military Science     | Aeronautical & Astronautical Engineering |    Colonel    | US Air Force (Retired) |       1       |       295       |      1      |      0.5       |                Apollo 15                |            |                              |
+-----------------+---------------------+------+----------+----------+------------+----------------+--------+---------------------------------------------------------------+--------------------------+------------------------------------------+---------------+------------------------+---------------+-----------------+-------------+----------------+-----------------------------------------+------------+------------------------------+

### Task 2: Astronaut Status: Counting the Cosmic Pioneers.
In the dim glow of computer screens, we embark on a journey to distill insights from data, transforming numbers into meaningful narratives. Our mission is to honor the dedication and diversity of cosmic pioneers, celebrating their contributions to humanity's quest for the stars.

We embark on this journey to distill insights from data, transforming numbers into meaningful narratives. The query groups astronauts by their status, revealing the dynamic tapestry of their careers - active, retired, or otherwise.

In [25]:
%%sql
select status, count(status) as Numbers  from cleaned_nasa group by status

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

4 rows affected.

+------------+---------+
|   status   | Numbers |
+------------+---------+
|  Deceased  |    48   |
|  Retired   |   217   |
|   Active   |    50   |
| Management |    36   |
+------------+---------+

### Task 3: Exploring Astronauts' Military Branch Diversity.
In the soft glow of computer screens, we continue our exploration of the astronaut dataset, our journey of honoring cosmic pioneers and uncovering the stories that connect them to the stars.

Our previous queries have illuminated the dynamic careers and diverse backgrounds of these space heroes. Now, we turn our attention to their military branches, a vital chapter in their incredible journeys.

In [28]:
%%sql
select Military_Rank,count(Military_Rank) as Count from cleaned_nasa group by Military_Rank

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

12 rows affected.

+----------------------+-------+
|    Military_Rank     | Count |
+----------------------+-------+
|     Rear Admiral     |   2   |
|       Captain        |  115  |
|       Colonel        |  155  |
|  Lieutenant Colonel  |   17  |
|      Commander       |   26  |
|    Major General     |   12  |
|  Brigadier General   |   7   |
|        Major         |   7   |
| Lieutenant Commander |   4   |
|     Vice Admiral     |   3   |
+----------------------+-------+
Truncated to displaylimit of 10.

### Task 4: Top Military Ranks Among Astronauts.
In the soft glow of computer screens, our cosmic journey through the astronaut dataset continues to unfold. Building upon our exploration of their military backgrounds, we now delve into the ranks that these celestial trailblazers once held in their respective armed forces.

In [32]:
%%sql
select Military_Rank,count(Military_Rank) as Count from cleaned_nasa group by Military_Rank order by 2 desc limit 5

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

5 rows affected.

+--------------------+-------+
|   Military_Rank    | Count |
+--------------------+-------+
|      Colonel       |  155  |
|      Captain       |  115  |
|     Commander      |   26  |
| Lieutenant Colonel |   17  |
|   Major General    |   12  |
+--------------------+-------+

### Task 5: Exploring Astronaut Demographics: Gender Insights.
Our cosmic journey through the astronaut dataset takes another captivating turn. Building upon our exploration of their military backgrounds and ranks, we now shift our focus to a crucial aspect of their diverse profiles: gender.

In [35]:
%%sql
select Gender, count(Gender) as Count from cleaned_nasa group by gender

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

2 rows affected.

+--------+-------+
| Gender | Count |
+--------+-------+
|  Male  |  302  |
| Female |   49  |
+--------+-------+

### Task 6: Astronauts' Life Expectancy: A Cosmic Perspective
As our cosmic journey through the astronaut dataset continues, we embark on a quest to understand the human lifespan within the realm of space exploration. Our focus now turns to the astronauts' life expectancies, a reflection of the profound experiences and challenges they've encountered.

In this exploration, we pay tribute to the resilience and courage of these cosmic pioneers. Each astronaut's life expectancy, whether achieved or anticipated, is a testament to the unwavering spirit that propels humanity beyond Earth's bounds.

In [83]:
%%sql
SELECT 
    AVG(CASE
        WHEN Death_Date != "" THEN TIMESTAMPDIFF(YEAR, Birth_date, Death_date)
        ELSE TIMESTAMPDIFF(YEAR, Birth_date, CAST('2023-01-01' AS DATE))
    END) AS Average_Year
FROM 
    cleaned_nasa

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

1 rows affected.

+--------------+
| Average_Year |
+--------------+
|   67.8490    |
+--------------+

### Task 7: Honoring Female Astronauts: Life Expectancy.
In our ongoing journey through the astronaut dataset, we now shine a spotlight on a remarkable group of cosmic trailblazersâ€”female astronauts. Their life expectancies, both achieved and anticipated, represent a testament to their extraordinary dedication and contribution to space exploration.

In [82]:
%%sql
SELECT 
    AVG(CASE
        WHEN Death_Date != "" THEN TIMESTAMPDIFF(YEAR, Birth_date, Death_date)
        ELSE TIMESTAMPDIFF(YEAR, Birth_date, CAST('2023-01-01' AS DATE))
    END) AS Average_Year
FROM 
    cleaned_nasa 
WHERE 
    gender = "Female"

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

1 rows affected.

+--------------+
| Average_Year |
+--------------+
|   60.5306    |
+--------------+

### Task 8: Celebrating Male Astronauts: Life Expectancy.
In our ongoing odyssey through the astronaut dataset, we now turn our attention to the remarkable group of male astronauts, who have left an indelible mark on the cosmos. The focus of our inquiry? Their life expectancies, a testament to their unyielding commitment and dedication to the exploration of space.

In [81]:
%%sql
SELECT 
    AVG(CASE
        WHEN Death_Date != "" THEN TIMESTAMPDIFF(YEAR, Birth_date, Death_date)
        ELSE TIMESTAMPDIFF(YEAR, Birth_date, CAST('2023-01-01' AS DATE))
    END) AS Average_Year
FROM 
    cleaned_nasa 
WHERE 
    gender = "Male"

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

1 rows affected.

+--------------+
| Average_Year |
+--------------+
|   69.0364    |
+--------------+

### Task 9: Cosmic Scholars: Top Graduate Majors of Astronauts.
As our cosmic exploration through the astronaut dataset unfolds, we turn our focus to the educational pathways of these cosmic adventurers. With a keen eye on their graduate majors, we aim to uncover the diverse academic foundations that have propelled them into the boundless realms of space.

This forthcoming query, though a mere compilation of data, is a portal to a world of knowledge. It reveals the top ten graduate majors, offering a glimpse into the educational tapestry that makes up the astronaut corps.

In [88]:
%%sql
Select Graduate_Major,count(Graduate_Major) as count from cleaned_nasa group by Graduate_Major order by count desc

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

143 rows affected.

+----------------------------+-------+
|       Graduate_Major       | count |
+----------------------------+-------+
|  Aeronautical Engineering  |   34  |
|   Aerospace Engineering    |   26  |
|          Physics           |   17  |
|          Medicine          |   16  |
|   Mechanical Engineering   |   14  |
|   Electrical Engineering   |   9   |
|        Astronautics        |   8   |
|        Aeronautics         |   7   |
| Aeronautics & Astronautics |   7   |
|      Aviation Systems      |   7   |
+----------------------------+-------+
Truncated to displaylimit of 10.

### Task 10: Educational Odyssey: Astronauts and Their Degrees.
In our continuous journey through the astronaut dataset, we are now casting a wide net to encompass the full educational spectrum of these cosmic pioneers. The query we have set in motion is a treasure trove of information, offering us a profound glimpse into the academic odysseys that have propelled astronauts to the stars.

As we meticulously examine these numbers, we are not merely dealing with data points; we are delving into the very essence of these space heroes. The "Number_of_Astronauts" figure serves as a testament to the exclusive fellowship of cosmic explorers, those who have boldly transcended the boundaries of Earth.

In [100]:
%%sql
select (select count(Undergraduate_Major) from cleaned_nasa) as Number_Undergraduate,(select count(Graduate_Major) from cleaned_nasa) as Number_Graduate from cleaned_nasa limit 1

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

1 rows affected.

+----------------------+-----------------+
| Number_Undergraduate | Number_Graduate |
+----------------------+-----------------+
|         351          |       351       |
+----------------------+-----------------+

### Task 11: Astronaut Birthplaces: Launching from Earth's Diverse Cities.
In our cosmic journey through the astronaut dataset, we now turn our gaze to the birthplaces of these intrepid space explorers. The query we've embarked upon, though a collection of data, is a portal to the origins of those who've ventured into the boundless cosmos.

As we dissect the numbers, we're not just dealing with statistics; we're unraveling the geographic tapestry that contributes to the astronaut corps. The birth states that emerge as the top five hold within them the beginnings of remarkable journeys.

Each city represents a unique chapter in the story of these cosmic pioneers. From bustling metropolises to quiet towns, these diverse origins reflect the universal aspiration to reach for the stars.

In [105]:
%%sql
select Birth_Place as State ,count(Birth_Place) as Count from cleaned_nasa group by Birth_Place order by 2 desc limit 5

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

5 rows affected.

+------------------+-------+
|      State       | Count |
+------------------+-------+
|  Cleveland, OH   |   8   |
|   Chicago, IL    |   7   |
|    Boston, MA    |   7   |
|   New York, NY   |   7   |
| Philadelphia, PA |   6   |
+------------------+-------+

### Task 12: Voyages Beyond: Astronauts' Space Flights and Spacewalks.
As our voyage through the astronaut dataset unfolds, we now set our sights on the extraordinary journeys that these cosmic pioneers have undertaken. The query we've embarked upon holds within it a wealth of experiences, a testament to the adventurous spirit of those who've ventured into the cosmos.

Our calculations of the average number of space flights and spacewalks provide insight into the vast range of missions and activities these astronauts have undertaken. Each decimal point in the result represents another moment in space, another step taken in the weightlessness of the cosmos.

These averages tell the story of dedication, training, and the relentless pursuit of scientific discovery and exploration. The numbers, though abstract, are a reflection of the countless hours of preparation and the courage required to journey beyond our planet.

In [118]:
%%sql
select (select AVG(Space_Walks) from cleaned_nasa) as AVG_Space_Walks,(select AVG(Space_Flights) from cleaned_nasa) as AVG_Space_Flights from cleaned_nasa limit 1

Running query in 'mysql+pymysql://root:***@localhost/nasa_data'

1 rows affected.

+-----------------+-------------------+
| AVG_Space_Walks | AVG_Space_Flights |
+-----------------+-------------------+
|      1.2678     |       2.3932      |
+-----------------+-------------------+